# SERIAL/dict/plc_cmd.py

comand = {
    "偏芯モータON" : b'\x06',
    "偏芯モータOFF" : b'\x07',
    "供給シリンダ前進" : b'\x08',
    "供給シリンダ後退" : b'\x0b',
    "原点復帰許可" : b'\x11',
    "ポンプON" : b'\x12',
    "ポンプOFF" : b'\x13',
    "エアブローON" : b'\x14',
    "エアブローOFF" : b'\x15',
    "吸着ON" : b'\x16',
    "吸着OFF" : b'\x17',
    "移動上下下降" : b'\x1a',
    "移動上下上昇" : b'\x1b',
    "移動モータ正転ON" : b'\x1c',
    "移動モータ正転OFF" : b'\x1d',
    "移動モータ逆転ON" : b'\x1e',
    "移動モータ逆転OFF" : b'\x1f',
    "寸法壁前進" : b'\x24',
    "寸法壁後退" : b'\x25',
    "寸法部ステーション上下ON" : b'\x28'    
}
